name: "image-preproc"
backend: "python"
max_batch_size: 0

input [
    {
        name: "IMAGES_SRC"
        data_type: TYPE_STRING
        dims: [ -1 ]
    }
]

output [
    {
        name: "IMAGES"
        data_type: TYPE_FP32
        dims: [3, 256, 256]
    }
]

instance_group [
    {
        count: 1
        kind: KIND_CPU
    }
]
